// https://yandex.ru/dev/dialogs/alice/doc/response.html				  
				  
				  
Функция ОбщийОбщийЗапуск(Запрос)
	//Ответ = Новый HTTPСервисОтвет(200);   
	//
	//СтрокаЗапроса = Запрос.ПолучитьТелоКакСтроку();

	//jsonзначение = ПрочитатьтекстЗапроса(СтрокаЗапроса);
	//	
	//user_id = jsonзначение.session.user_id;
	//application_id = jsonзначение.session.application.application_id;
	//session_id = jsonзначение.session.session_id;
	//
	//// payload
	//Если jsonзначение.request.Свойство("payload") тогда 
	//	payload = jsonзначение.request.payload;            
	//Иначе
	//	payload = Новый структура;
	//КонецЕсли;
	//
	//Если jsonзначение.request.Свойство("command") тогда 
	//	command = jsonзначение.request.command;            
	//Иначе
	//	command = "";
	//КонецЕсли;
	//
	////"type": "ButtonPressed"
	////"type": "SimpleUtterance"
	//
	//
	//
	//ЛогЗаписи = РегистрыСведений.ЛогЗапросов.СоздатьМенеджерЗаписи();
	//ЛогЗаписи.IdClient = user_id;        
	//ЛогЗаписи.session_id = session_id;
	//ЛогЗаписи.ДатаВремя = ТекущаяДата();
	//ЛогЗаписи.ТекстЗапроса = СтрокаЗапроса;
	//ЛогЗаписи.Записать(Истина);
	//
	//
	//
	//КонтекстКоманды = Новый Структура;
	//
	//
	//СтрОтвет = ПолучитьРезультатКоманды(command,КонтекстКоманды);
	//
	//ТекстОтвет = ПодготовитьОтвет(СтрОтвет);
	//
	//ответ.УстановитьТелоИзСтроки(ТекстОтвет );
	//
	//Возврат Ответ;
КонецФункции

Функция ПолучитьРезультатКоманды(ТекстКоманды,КонтекстКоманды)
	
	end_session = Ложь;
	
	СтрОтвет = Новый Структура;
	
	мКнопок = Новый массив;
	
	Если ТекстКоманды = "помощь" тогда
		ТекстОтвета = "Представьтесь, авторизируйтесь через модератора и взаимодействуйте с нашей программой через администратора.";
		
		СтрКнопка = Новый структура("title,payload,url,hide","Зарегистрироваться в прожар","{""newdsad"": true }","https://example.com/",Истина);
		мКнопок.Добавить(СтрКнопка);    
		
		
		payload = Новый Структура;                                             
		payload.Вставить("Дата","12.01.2023");                                             
		payload.Вставить("ФИО","Петров");                                             
		
		
		СтрКнопка = Новый структура("title,payload,url,hide","Кнопка 1",payload,"http://yandex.ru",Истина);
		мКнопок.Добавить(СтрКнопка);
		
				 //"buttons"
		
	ИначеЕсли ТекстКоманды = "что ты умеешь" тогда
		ТекстОтвета = "Я могу помогать работать с прожаром, выдавать информацию о работе, подсказывать что нужно сделать.";
	ИначеЕсли ТекстКоманды = "кто такой директор" тогда
		ТекстОтвета = "Наш бог и господин.";
	ИначеЕсли ТекстКоманды = "кто я" тогда
		ТекстОтвета = "Иванов Иван иванович";
	ИначеЕсли ТекстКоманды = "какая пекарня установлена" тогда
		ТекстОтвета = "Амирхана 21";
	ИначеЕсли ТекстКоманды = "какие ближайшие планы" тогда
		ТекстОтвета = "в 11.00 выпуск треугольник курица, в 12.45 Киш, в 13.10 Сосиска в тесте";
	Иначе		
		ТекстОтвета = "Пока ничего не понятно.";
	КонецЕсли;
	
	
	
	
	Структураresponse = Новый Структура;
    Структураresponse.Вставить("text",ТекстОтвета);
    Структураresponse.Вставить("tts",ТекстОтвета);
    Структураresponse.Вставить("buttons",мКнопок);
    Структураresponse.Вставить("end_session",end_session);
	
	
	СтрОтвет.Вставить("response",Структураresponse);	
	
	СтрОтвет.Вставить("version","1.0");
	
	Возврат СтрОтвет;
КонецФункции


// Помощь" и "Что ты умеешь?

#Область Ответы

Функция ПрочитатьтекстЗапроса(Содержимое)

	Попытка
		ЧтениеJSON = новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Содержимое);
		ПолученныйОтвет = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		ПолученныйОтвет = "";
	КонецПопытки;
	
	Возврат  ПолученныйОтвет;
КонецФункции

// Функция - Подготовить ответ
//
// Параметры:
//  ОбъектСДанными	 - Структура  -  с данными для превращения в текст JSON	 
// 
// Возвращаемое значение:
//   - Строка в формате JSON
//
Функция ПодготовитьОтвет(ОбъектСДанными) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ОбъектСДАнными);
	ТекстОтвета = ЗаписьJSON.Закрыть();
	
	Возврат  ТекстОтвета;
КонецФункции

#КонецОбласти


