Процедура ДобавитьИнструменты(Инструменты) Экспорт

	ДобавитьИнструментСтруктураОбъектаКлиента(Инструменты);

КонецПроцедуры

Функция ВыполнитьИнструмент(ИмяИнструмента, Аргументы) Экспорт

	Если ИмяИнструмента = "get_metadata_structure_client" Тогда
		Возврат СтруктураОбъектаМетаданных(Аргументы);
	Иначе
		ВызватьИсключение "Неизвестный инструмент: " + ИмяИнструмента;
	КонецЕсли;

КонецФункции

#Область ИнструментСтруктураОбъектаКлиента

Процедура ДобавитьИнструментСтруктураОбъектаКлиента(Инструменты)

	// Создаем описания параметров для инструмента get_metadata_structure
	МассивПараметров = Новый Массив;
	
	// Параметр clientId - ID клиента, для поиска в РС 
		
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"clientId",
		"string",
		"Идентификационный номер клиента системы",
		,
		Истина,
	));
	
	МассивПараметров.Добавить(mcp_Метаданные.ПараметрИнструмента(
		"clientBase",
		"string",
		"Наменование конфигурации клиента",
		,
		Истина,
	));
		
	// Создаем JSON-схему параметров
	СхемаПараметров = mcp_Метаданные.СхемаПараметровИнструмента(МассивПараметров);
	
	// Добавляем инструмент в таблицу
	mcp_Метаданные.ДобавитьИнструмент(
		Инструменты,
		"get_metadata_structure_client",
		"Получение структуры объекта метаданных клиента по ИД",
		СхемаПараметров
	);

КонецПроцедуры

Функция СтруктураОбъектаМетаданных(Аргументы)

	ИДКлиента = Аргументы.clientId;
	Конфигурация = Аргументы.clientBase;
				
	Возврат mcp_Метаданные.ОписаниеСтруктурыОбъектаМетаданныхКлиента(ИДКлиента, Конфигурация);
	
КонецФункции

#КонецОбласти

