
// Спросить LMНа сервере.
&НаСервере
Процедура СпроситьLMНаСервере()


	Соединение = Новый HTTPСоединение("localhost",1234,,,,180);
	
    // 2. Формируем данные запроса
    ДанныеJSON = Новый Структура;
    ДанныеJSON.Вставить("model", "qwen/qwen3.5-9b");
    ДанныеJSON.Вставить("input", ТекстЗапроса);
	ДанныеJSON.Вставить("integrations", Новый Массив);

	ОписаниеMcp = Новый Структура;
	ОписаниеMcp.Вставить("type", "ephemeral_mcp");
	ОписаниеMcp.Вставить("server_label", "sas");
	ОписаниеMcp.Вставить("server_url", "http://localhost/sas/hs/mcp/");
	ОписаниеMcp.Вставить("allowed_tools", Новый Массив);
	
	ОписаниеMcp.allowed_tools.Добавить("list_metadata_objects");
	ОписаниеMcp.allowed_tools.Добавить("get_metadata_structure");
	ОписаниеMcp.allowed_tools.Добавить("get_metadata_structure_client");
	
	ДанныеJSON.integrations.Добавить(ОписаниеMcp);

    // 3. Преобразуем в JSON
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
    СтрокаJSON = ЗаписьJSON.Закрыть();

    // 4. Создаём и настраиваем запрос
    Запрос = Новый HTTPRequest("api/v1/chat/");
    Запрос.Заголовки.Вставить("Content-Type", "application/json");
    Запрос.УстановитьТелоИзСтроки(СтрокаJSON);

    // 5. Отправляем и обрабатываем ответ
    Попытка
        Ответ = Соединение.ОтправитьДляОбработки(Запрос);
        Если Ответ.КодСостояния = 200 Тогда
            ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
            ЧтениеJSON = Новый ЧтениеJSON;
            ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
            ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON);
            ЧтениеJSON.Закрыть();

//            Если ДанныеОтвета.СодержитКлюч("choices") И ДанныеОтвета.choices.Количество() > 0 Тогда
//                ОтветМодели = ДанныеОтвета.choices[0].message.content;
//                Сообщить("Получен ответ от модели:");
//                Сообщить(ОтветМодели);
//            Иначе
//                Сообщить("В ответе нет данных от модели");
//            КонецЕсли;
        Иначе
            Сообщить("Ошибка: код ответа " + Ответ.КодСостояния);
        КонецЕсли;
    Исключение
        Сообщить("Ошибка при запросе: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура СпроситьLM(Команда)
	СпроситьLMНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпроситьYandexGptНаСервере()
	
	Объект.ОтветYandexGPT = ЯндексGPT.ОтправитьЗапросКYandexGPT(
		"Разбери ошибку из текста JSON для 1С. Дай полный анализ, напиши рекомендации по исправлению. Классифицируй ошибки по видам (Программная или аналитическая). Дай развернутый ответ. Текст:" 
		+ Символы.ПС + Объект.ТекстОтчетаJSON);

	//ЭтотОбъект.ТекстОтветаYandexGPT = ОтветYandexGPT;

КонецПроцедуры

&НаКлиенте
Процедура СпроситьYandexGpt(Команда)
	СпроситьYandexGptНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыФайлНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды);
		
КонецПроцедуры 

Функция СтрокаКоманды(СсылкаНаФайл, Расширение)
			
	СтрокаКоманды = "";
	
	ЭлементСправочника = СсылкаНаФайл.ПолучитьОбъект();

	// Получаем двоичные данные
	ДвоичныеДанные = ЭлементСправочника.ДанныеФайла.Получить();

	// Временный файл для отображения
	ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ВременныйФайл);

	Файл = Новый Файл(ВременныйФайл);
	    
	Если Файл.Существует() Тогда
		
		СтрокаКоманды = ВременныйФайл;
		
	КонецЕсли;
	
	Возврат СтрокаКоманды;
	
КонецФункции

Процедура Оповещение(КодВозврата, ДопПараметры) Экспорт

	

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыФайлОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды); 
	
КонецПроцедуры



