
&НаСервере
Процедура СпроситьYandexGptНаСервере()
	Объект.ОтветYandexGPT = ЯндексGPT.ОтправитьЗапросКYandexGPT(
		"Разбери ошибку из текста JSON для 1С. Дай полный анализ, напиши рекомендации по исправлению. Классифицируй ошибки по видам (Программная или аналитическая). Дай развернутый ответ. Текст:" 
		+ Символы.ПС + Объект.ТекстОтчетаJSON);

	//ЭтотОбъект.ТекстОтветаYandexGPT = ОтветYandexGPT;

КонецПроцедуры

&НаКлиенте
Процедура СпроситьYandexGpt(Команда)
	СпроситьYandexGptНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыФайлНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды);
		
КонецПроцедуры 

Функция СтрокаКоманды(СсылкаНаФайл, Расширение)
			
	СтрокаКоманды = "";
	
	ЭлементСправочника = СсылкаНаФайл.ПолучитьОбъект();

	// Получаем двоичные данные
	ДвоичныеДанные = ЭлементСправочника.ДанныеФайла.Получить();

	// Временный файл для отображения
	ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ВременныйФайл);

	Файл = Новый Файл(ВременныйФайл);
	    
	Если Файл.Существует() Тогда
		
		СтрокаКоманды = ВременныйФайл;
		
	КонецЕсли;
	
	Возврат СтрокаКоманды;
	
КонецФункции

Процедура Оповещение(КодВозврата, ДопПараметры) Экспорт

	

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыФайлОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	СтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), СтрокаКоманды); 
	
КонецПроцедуры


