
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоДаннымОтчета();
	
	Объект.НастройкаLLM = Справочники.НастройкиЗапросовLlm.Стандарт;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрисоединенныеФайлыФайлНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), ТекущаяСтрокаКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СпроситьЯзыковуюМодель(Команда)
	СпроситьЯзыковуюМодельНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СпроситьYandexGpt(Команда)
	СпроситьЯндексГПТНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	ТекущаяСтрока = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Сообщить("Выберите файл для просмотра!");
        Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаКоманды = СтрокаКоманды(ТекущаяСтрока.Файл, ТекущаяСтрока.РасширениеФайла);
	
	НачатьЗапускПриложения(Новый ОписаниеОповещения("Оповещение", ЭтотОбъект), ТекущаяСтрокаКоманды);
		
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Оповещение(КодВозврата, ДопПараметры) Экспорт

КонецПроцедуры

&НаСервере
Процедура СпроситьЯзыковуюМодельНаСервере()
	
	Настройки = Объект.НастройкаLLM.ПолучитьОбъект();
	
	ТекстЗапроса = Настройки.ОписаниеЗапроса;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{clientid", ИдКлиента);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{clientbase}", name);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{text}", Объект.ТекстОтчетаJSON);	
	
	Соединение = Новый HTTPСоединение("localhost", 1234, , , , 3600);
	
	ДанныеДляЗапроса = Новый Структура;
	ДанныеДляЗапроса.Вставить("model", "qwen/qwen3.5-35b-a3b");
	ДанныеДляЗапроса.Вставить("input", ТекстЗапроса);
	ДанныеДляЗапроса.Вставить("integrations", Новый Массив);
	
	McpServerDescription = Новый Структура;
	McpServerDescription.Вставить("type", "ephemeral_mcp");
	McpServerDescription.Вставить("server_label", "sas");
	McpServerDescription.Вставить("server_url", "http://localhost/sas/hs/mcp/");
	McpServerDescription.Вставить("allowed_tools", Новый Массив);
	
	McpServerDescription.allowed_tools.Добавить("list_metadata_objects");
	McpServerDescription.allowed_tools.Добавить("get_metadata_structure");
	McpServerDescription.allowed_tools.Добавить("get_metadata_structure_client");
	
	ДанныеДляЗапроса.integrations.Добавить(McpServerDescription);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляЗапроса);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Запрос = Новый HTTPRequest("api/v1/chat/");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);

	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
			ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
		Иначе
			Сообщить("Ошибка: код ответа " + Ответ.КодСостояния);
		КонецЕсли;
	Исключение
		Сообщить("Ошибка при запросе: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура СпроситьЯндексГПТНаСервере()
	
	Объект.ОтветLlm = ЯндексGPT.ОтправитьЗапросКYandexGPT(
		"Разбери ошибку из текста JSON для 1С. Дай полный анализ, напиши рекомендации по "
		+ "исправлению. Классифицируй ошибки по видам (Программная или аналитическая). "
		+ "Дай развернутый ответ. Текст:" 
		+ Символы.ПС + Объект.ТекстОтчетаJSON);

КонецПроцедуры

Функция СтрокаКоманды(СсылкаНаФайл, Расширение)
			
	РезультатСтрокаКоманды = "";
	
	ЭлементСправочника = СсылкаНаФайл.ПолучитьОбъект();

	ДвоичныеДанные = ЭлементСправочника.ДанныеФайла.Получить();

	ВременныйФайл = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ВременныйФайл);

	Файл = Новый Файл(ВременныйФайл);
	    
	Если Файл.Существует() Тогда
		
		РезультатСтрокаКоманды = ВременныйФайл;
		
	КонецЕсли;
	
	Возврат РезультатСтрокаКоманды;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДаннымОтчета()
	
	ТекстОтчетаJSON = Объект.ТекстОтчетаJSON;
	
	Если ТекстОтчетаJSON = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(ТекстОтчетаJSON);
		ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);
		ЧтениеJson.Закрыть();
	Исключение
		Возврат;
	КонецПопытки;
	
	ДанныеСистемы = ОтчетСтруктура.clientInfo.systemInfo;
	
	ИдКлиента = ДанныеСистемы.clientID;
	freeRAM  = ДанныеСистемы.freeRAM;
	fullRAM  = ДанныеСистемы.fullRAM;
	osVersion = ДанныеСистемы.osVersion;
	processor = ДанныеСистемы.processor;
	
	ДанныеПриложения = ОтчетСтруктура.clientInfo;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПриложения);
	
	ДанныеКонфигурации = ОтчетСтруктура.configInfo;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеКонфигурации);
	
	Если ОтчетСтруктура.configInfo.Свойство("extentions") Тогда
		Для Каждого Элемент Из ОтчетСтруктура.configInfo.extentions Цикл
			НоваяСтрока = СписокРасширений.Добавить();
			НоваяСтрока.Расширение = Элемент[0];
		КонецЦикла;
	КонецЕсли;	
					
	ТекстОшибки = ОтчетСтруктура.errorInfo.applicationErrorInfo.errors[0][0];
	КонтекстОшибки = ОтчетСтруктура.errorInfo.applicationErrorInfo.stack[0][0];
	СтрокаКодаОшибки =  ОтчетСтруктура.errorInfo.applicationErrorInfo.stack[0][2];
	НомерСтрокиОшибки = ОтчетСтруктура.errorInfo.applicationErrorInfo.stack[0][1];
	
	Пользователь = ОтчетСтруктура.sessionInfo.userName;
	
	//Тестовая строка
	
КонецПроцедуры

#КонецОбласти
 


