
&После("ОбработкаОтображенияОшибки")
Процедура САС_ОбработкаОтображенияОшибки(ИнформацияОбОшибке, ТребуетсяЗавершениеСеанса, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	 //СтандартнаяОбработка = Ложь;
	
////	 Отчет_об_ошибке = Новый ОтчетОбОшибке(ИнформацияОбОшибке());
	 //Отчет_об_ошибке.Отправить(Истина);	 //
	 //Сообщить("Привет"); 
	 //
	 //Временный_zip_файл = ПолучитьИмяВременногоФайла("zip");
	 //		
	 //   // Регистрация (сохранение и отправки данных) ошибки
	 //   Отчет_об_ошибке = Новый ОтчетОбОшибке(ИнформацияОбОшибке());
	 //   Поток = Новый ПотокВПамяти;
	 //   Отчет_об_ошибке.Записать(Поток);
	 //   
	 //   //САС_ОбщийМодульСервер.ХЗ(Поток);
	 //   
	 //   
	 //   Чтение = Новый ЧтениеФайлаАрхива(Поток);
	 //   //Отчет_об_ошибке.ДанныеОтчета
		
		//Поток = Новый ПотокВПамяти;
		//Запись = Новый ЗаписьДанных(Поток);
		//Запись.Записать(Отчет_об_ошибке);
		
		//ХЗ = Новый ХранилищеЗначения(Поток);
		//
		//ДД = Новый ДвоичныеДанные(Поток);
		
		//Отчет_об_ошибке.Записать(Поток);
		//ДанныеФайла = Поток.ЗакрытьИПолучитьДвоичныеДанные(); 
		//Строка = Base64Строка(ПолучитьСтрокуИзДвоичныхДанных(ДанныеФайла));
		
		// Получаем имя каталога временных файлов пользователя
		//Каталог_файлов = "D:\1C\Ласточка\files" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		//
		//// Чтение файла ZIP
		//Архив_zip  = Новый ЧтениеZipФайла(Временный_zip_файл);
		//Архив_zip.ИзвлечьВсе(Каталог_файлов, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		//
		//// Случайное число в диапазоне от 1 до 999999 для рандомного имени файла
		//ГенераторСлЧисел = Новый ГенераторСлучайныхЧисел();
		//СлучЧисло=ГенераторСлЧисел.СлучайноеЧисло(1,999999);
		//
		//// Сохраняем скриншот 1С в папку
		//Путь_к_скриншоту = Каталог_файлов + "\screen"+СлучЧисло+".png";
		//КопироватьФайл(Путь_к_скриншоту, Полный_путь_к_файлу);
		//
		////Привет;
		

КонецПроцедуры
